#+title: notes/emacs
<2022-03-18 Fri>
** Variadic / Rest
- When the last argument of the argument list is =&rest <NAME_OF_REST_VAR>= the function will accept any number of arguments
- The rest variables will be stored in a list with the given name
- The below example shows using higher order functions with optional params
#+begin_src elisp
(defun ajr-example-opt-var-low (a b &optional c &rest d)
  (append
   (list a)
   (list b)
   (list c)
   d))

(defun ajr-example-opt-var-high (&optional c &rest d)
  (ajr-example-opt-var-low "higher" "order" c d))


(ajr-example-opt-var-high "args" 1 2 3 4 5 6 7 8 "...")
#+end_src

#+RESULTS:
| higher | order | args | (1 2 3 4 5 6 7 8 ...) |
